{
  "patient_information": "72-year-old male farmer, no comorbidities or immunosuppression reported.",
  "chief_complaint": "Extensive, painful verrucous skin lesions on left foot and lower leg.",
  "history_of_present_illness": "Ten years prior, leech bite on dorsum of left foot, one week later small painless red nodule developed at site. Over following years lesion slowly increased in size, further lesions developed and spread up to knee. Three days before admission ankle became painful and swollen.",
  "exposure_and_epidemiology": "Farmer in northern Laos, leech bite exposure.",
  "vitals": "Normal vital signs, afebrile.",
  "physical_exam": "Left lower leg and foot grossly swollen, skin hyperaemic and hot. Several cauliflower-like masses and oval plaque-like lesions on left lower leg and foot, partly erythematous, partly fungating and purulent, oozing bad odour.",
  "labs_and_diagnostics": "Radiography of left leg and foot showed no bone involvement. Direct microscopic investigations of wet film lesion scrapings revealed characteristic brownish, round, thick-walled, multiseptate sclerotic cells typical of chromoblastomycosis. Bacterial culture of pus grew Escherichia coli. PCR from skin tissue positive, sequencing revealed 100% similarity with Fonsecaea pedrosoi, F. monophora and F. nubica.",
  "differential_diagnosis": "Chronic verrucous skin lesions in fungal infections like sporotrichosis and chromoblastomycosis. Mycetoma (Madura Foot) by fungi or actinomycetes. Mycobacterial infections (cutaneous tuberculosis, lepromatous leprosy, atypical mycobacteria). Cutaneous leishmaniasis not reported in Laos. In HIV-positive, Kaposi’s Sarcoma. Non-infectious: squamous cell carcinoma, sarcoidosis, chronic eczema, psoriasis. Acute inflammatory signs indicate bacterial superinfection or deep vein thrombosis.",
  "management_and_clinical_course": "Secondary bacterial superinfection suspected, iodine-based antiseptics applied locally, oral antibiotics started initially cloxacillin and metronidazole, changed to co-trimoxazole guided by susceptibility. Antifungal treatment initiated with itraconazole 400mg/d for 7 days monthly pulse therapy, surgical debridement of all lesions. Oral terbinafine added initially 500mg/d, later 750mg/d for 9 months, local terbinafine ointment for 6 months. Liver function tests and serum glucose monitored, remained normal. Lesions healed uneventfully with some residual swelling and hypopigmentation.",
  "final_diagnosis": "Chromoblastomycosis caused by Fonsecaea spp., confirmed by direct microscopy showing sclerotic cells, PCR and sequencing. Diagnosis aligns with chronic verrucous lesions post-trauma, endemic area. Alternatives ruled out by confirmatory microbiology.",
  "disease_name_short": "Chromoblastomycosis"
}