{
  "patient_information": "35-year-old male farmer from the Peruvian highlands with no reported comorbidities or immunosuppression. No vaccination or allergy information stated.",
  "chief_complaint": "Slowly growing ulcer and multiple painless nodules on the left arm for 2 months.",
  "history_of_present_illness": "Two months prior, the patient suffered a scratch on his left hand from a tree branch while working in the fields. After a few days, he noticed a small painless erythematous papule that developed into a pustule. He took antibiotics without improvement. Over the following weeks, new pustules appeared, the lesion ulcerated and increased in size despite continued antibiotics and topical traditional medicines. Four weeks after the initial papule, painless firm nodules appeared on his left forearm. He was treated empirically for cutaneous leishmaniasis with a 20-day course of pentavalent antimonials but showed no improvement.",
  "exposure_and_epidemiology": "Farmer in the Peruvian highlands, scratch from tree branch while working in fields. Denies recent contact with animals or travel.",
  "vitals": "Vital signs normal, afebrile.",
  "physical_exam": "Generally well. Single ulcerative lesion (20 × 30 mm) on left hand with irregular elevated borders and multiple subcutaneous erythematous nodules (10 × 10 mm) along the lymphatic tract of the left arm.",
  "labs_and_diagnostics": "WBC 4.5 ×10^9/L with normal differential, haemoglobin 11.3 g/dL. Chest x-ray normal, PPD skin test negative. No Leishmania parasites on direct microscopy, leishmanin skin test negative. Mycobacterial cultures negative. Culture of ulcer scraping and nodule aspiration positive for Sporothrix schenckii.",
  "differential_diagnosis": "Cutaneous leishmaniasis, suggested by endemic area and presentation but unlikely due to no response to antimonials. Sporotrichosis, typical clinical features and common in Peru. Mycobacterial infection by Mycobacterium tuberculosis or M. marinum, considered due to possible exposure but no water exposure for M. marinum. Nocardiosis and tularaemia unlikely due to rarity and absence in region.",
  "management_and_clinical_course": "Specimens collected for microscopy, culture, and PCR. Started on itraconazole PO 200 mg/day. After 8 months of treatment, the ulcer and nodular lesions resolved, and the patient was considered cured.",
  "final_diagnosis": "Lymphocutaneous sporotrichosis caused by Sporothrix schenckii, confirmed by positive culture from ulcer scraping and nodule aspiration. The diagnosis aligns with the history of trauma from plant material, nodular lymphangitis, and lack of response to leishmaniasis treatment. Other differentials like leishmaniasis and mycobacterial infections were ruled out by negative tests and cultures.",
  "disease_name_short": "Sporotrichosis"
}