{
  "patient_information": "24-year-old man of Turkish origin, German resident who visits rural eastern Turkey annually for 6 weeks.",
  "chief_complaint": "Right upper quadrant pain, nausea, and vomiting.",
  "history_of_present_illness": "Three years prior, the patient presented with right upper quadrant pain. Ultrasound and CT revealed two calcified cystic liver lesions (one 7x6cm in the right lobe, WHO CE3b; one 5x4cm in the left lobe, WHO CE1). Serology was positive for Echinococcus granulosus, and cystic echinococcosis (CE) was diagnosed. Anthelmintic treatment was not pursued due to calcified cyst walls. The patient refused surgery as he was asymptomatic, and the cysts were monitored by ultrasound. Currently presents with acute right upper quadrant pain, nausea, and vomiting, along with scleral jaundice.",
  "exposure_and_epidemiology": "Of Turkish origin; German resident, but visits family in rural eastern Turkey (Anatolia), a hyperendemic region for CE, every year for about 6 weeks. This provenance is considered the most important risk factor.",
  "vitals": "Blood pressure: 110/70 mmHg, Pulse: 64 bpm, Temperature: 36°C (96.8°F).",
  "physical_exam": "Fair general condition with scleral jaundice. Right upper quadrant and epigastric tenderness present, but no guarding.",
  "labs_and_diagnostics": "Past (3 years prior): Ultrasound and CT scan showed two calcified cystic liver lesions (one 7x6cm in the right lobe with solid matrix, multiple smaller cysts, partially calcified wall, WHO CE3b; one 5x4cm in the left lobe with liquid content, double line sign, hydatid sand, wall up to 4mm thick with partial calcification, WHO CE1). Serology positive for Echinococcus granulosus. Current Presentation: Full blood count: Normal. AST: 145 U/L (Ref <35), ALT: 454 U/L (Ref <35), GGT: 394 U/L (Ref <55), ALP: 402 U/L (Ref 38–126), Total bilirubin: 120 μmol/L (Ref <19.0), ESR: 17/40 mm/h (Ref <10/20), CRP: 49 mg/L (Ref <5). During Current Management: Endoscopic retrograde cholangiography (ERC) revealed biliary obstruction due to a cystobiliary fistula.",
  "differential_diagnosis": "Congenital simple hepatic cyst, pseudocysts (necrotic cavity) in alveolar echinococcosis (E. multilocularis), bacterial abscesses, amoebic abscesses, tuberculoma, benign and malignant liver tumors, metastases.",
  "management_and_clinical_course": "At current presentation, a cystobiliary fistula with biliary obstruction, potentially complicated by bacterial cholangitis, was suspected. Endoscopic retrograde cholangiography (ERC) was performed, confirming biliary obstruction due to a cystobiliary fistula. CE cyst content was removed from the common bile duct, and bile flow was restored. Bacterial cholangitis was treated with ciprofloxacin and metronidazole. After inflammation settled, the patient underwent surgery for partial cystectomy of both liver cysts. The patient has been followed up for 9 years post-surgery with no recurrence and is considered cured.",
  "final_diagnosis": "Cystic Echinococcosis (CE) with acute complication of cystobiliary fistula and biliary obstruction, complicated by bacterial cholangitis.",
  "disease_name_short": "Cystic Echinococcosis"
}