{
  "patient_information": "40-year-old Thai woman, married, housewife, lived in Germany for the past 13 years.",
  "chief_complaint": "Severe headache for the past 8 days.",
  "history_of_present_illness": "The headache was of gradual onset and did not respond to any painkillers. She denied fever, chills, visual problems, weakness of limbs, or memory problems. Her past medical history is unremarkable. Three days prior, she presented to a municipal hospital where a CT scan of her brain was normal and blood count was normal (differential white cell count not done).",
  "exposure_and_epidemiology": "Ten days earlier she had returned from a 4-week journey to north-east Thailand, where she visited friends and relatives. During her visit she ate traditional regional dishes, including freshwater fish, seafood, snails and frogs. Her brother-in-law, with whom she had shared several traditional meals, has also fallen ill with a severe headache.",
  "vitals": "Afebrile.",
  "physical_exam": "Afebrile. Neck supple, Lasègue’s sign negative. Pupils equal, round, and reactive to light and accommodation; no cranial nerve palsies. Remainder of neurological examination, including higher cortical functions, unremarkable. No rash, no oral thrush, no subcutaneous swellings. Cardiopulmonary examination normal. Liver and spleen not enlarged. No lymphadenopathy. No meningism and no focal neurological deficits.",
  "labs_and_diagnostics": "Previous (3 days prior): CT scan of brain normal, blood count normal. \nAt presentation: WBC 12.3 x 10^9/L (Ref: 4–10); Eosinophils 2.34 x 10^9/L (Ref: <0.5); Haemoglobin 11.7 mg/dL (Ref: 12–14); MCV 70 fL (Ref: 83–103); Platelets 330 x 10^9/L (Ref: 150–350); ESR 20 mm/h (Ref: <10); IgE 944 U/mL (Ref: <100); Creatinine 62 μmol/L (Ref: <80); ALT 28 U/L (Ref: <30); GGT 35 U/L (Ref: <40); C-reactive protein <5 mg/L (Ref: <5).\nLumbar Puncture: CSF opening pressure 34 cmH2O (Ref: 12–20); 1877 leukocytes/μL (Ref: <5) with 42% eosinophils, 39% lymphocytes, 18% monocytes, 1% neutrophils; Protein 1.59 g/L (Ref: <0.45); Glucose 1.85 mmol/L (Ref: 2.2–3.9). No larvae detected on microscopic examination. Ziehl–Neelsen stain negative, cryptococcal antigen negative. No suspected malignant cells. CSF culture negative for bacterial or fungal growth. \nOther Serologies: Urine and stool microscopy negative for Schistosoma ova. Taenia solium serology negative, Fasciola hepatica serology negative, Paragonimus serology negative. Toxocara canis serology weakly positive (no change on follow-up). HIV serology negative. \nFinal Serology (post-discharge): Western Blot showed specific antibodies against 31kD Angiostrongylus cantonensis antigen.",
  "differential_diagnosis": "Food-borne parasitic infection of the meninges (presumptive). Main differential diagnoses included fungal meningitis with Coccidioides immitis, lymphoma, eosinophilic leukaemia, sarcoid, and idiopathic hypereosinophilic syndrome.",
  "management_and_clinical_course": "Lumbar puncture was performed, which relieved the patient's headache. It was repeated twice, after which the patient felt markedly better. No further specific treatment was prescribed. She received iron tablets for a mild microcytic anaemia. The patient was discharged significantly improved after a 1-week hospital stay. At 4-week follow-up, she had fully recovered, and her peripheral eosinophil count had returned to normal.",
  "final_diagnosis": "Eosinophilic Meningitis due to Angiostrongylus cantonensis infection.",
  "disease_name_short": "Angiostrongyliasis"
}