{
  "patient_information": "53-year-old Malawian man, subsistence farmer, non-smoker, married with five children who are all well. No past medical history or known comorbidities. Newly diagnosed HIV-positive with advanced immunosuppression.",
  "chief_complaint": "Productive cough with whitish sputum for 3 months.",
  "history_of_present_illness": "Also reports night sweats and unquantified weight loss. Two months earlier, presented with same complaints and given presumptive antimalarials and amoxicillin for 5 days, but no improvement. No known tuberculosis contacts.",
  "exposure_and_epidemiology": "From Malawi, high HIV-prevalence setting in sub-Saharan Africa. No mining or construction work. No specific travel, vector, animal, water/food risks, or sick contacts mentioned.",
  "vitals": "Temperature 38.8°C (101.8°F), blood pressure 100/80 mmHg, pulse 88 bpm, oxygen saturation 97% on ambient air.",
  "physical_exam": "Slightly wasted, mildly anaemic. Normal mouth examination without thrush, Kaposi’s sarcoma, or oral hairy leukoplakia. Clear chest, normal heart sounds. No lymphadenopathy, liver or spleen not enlarged.",
  "labs_and_diagnostics": "HIV serology positive. WBC 3.2 ×10^9/L, haemoglobin 9.8 g/dL, MCV 90 fL, platelets 305 ×10^9/L, CD4 count 54 cells/μL. Sputum for AFB 2×negative. Malaria RDT and thick smear negative. Chest radiograph shows prominent hilar region bilaterally but otherwise normal. Induced sputum negative for AFB, no PCR available. Exercise test negative.",
  "differential_diagnosis": "Smear-negative pulmonary tuberculosis, common in advanced HIV. Pneumocystis jirovecii pneumonia due to lack of prophylaxis. Concomitant bacterial chest infection unlikely for entire duration. Pulmonary Kaposi’s sarcoma less likely without other lesions or typical radiograph. Pulmonary malignancy or sarcoidosis less likely in this setting. Gram-negative sepsis from invasive non-typhoidal Salmonellae considered for fever and anaemia.",
  "management_and_clinical_course": "Induced sputum examined for AFB. Real-time PCR like Xpert MTB/RIF recommended. Mycobacterial cultures, bronchoscopy if available, urine LAM, ultrasound for extrapulmonary TB. Empirical antituberculous treatment justifiable, with prednisolone to reduce IRIS. Additional antibiotics considered, blood cultures if available. High-dose co-trimoxazole for presumptive PCP if no improvement. ART initiated within 8 weeks, or 2 weeks if CD4 <50 cells/μL.",
  "final_diagnosis": "Smear-negative pulmonary tuberculosis caused by Mycobacterium tuberculosis, diagnosed clinically in HIV-positive patient with chronic cough, night sweats, weight loss, low CD4, and prominent hilar on radiograph. Negative sputum microscopy common in advanced immunosuppression. PCP less likely with normal oxygen and negative exercise test; KS unlikely without skin/oral lesions.",
  "disease_name_short": "Pulmonary tuberculosis"
}