{
  "patient_information": "A 22-year-old male farmer from rural northern Ethiopia.",
  "chief_complaint": "Difficulty walking.",
  "history_of_present_illness": "His problem started 10 years ago, when he woke from sleep one morning and noticed weakness in both legs. There was no history of trauma and no prodromal symptoms, and he had been in excellent health before. The weakness in his legs rapidly progressed over 4 to 5 days, leading to him needing a cane for mobility. He had no back pain, sensory complaints, sphincter disturbance or upper limb symptoms. The start of his illness coincided with a period of drought and famine, when his diet almost exclusively consisted of grass peas (Lathyrus sativus, local name guaya). Despite the monotonous diet, he had been engaged in hard physical labour on his family farm. His walking difficulty finally meant that he could not return to farm work. At the age of 20, he moved to the capital city seeking an alternative job. He migrated along with another young male farmer from his village who had suffered a similar fate, developing weakness of both legs and arms during the same period of drought.",
  "exposure_and_epidemiology": "From rural northern Ethiopia. His diet almost exclusively consisted of grass peas (Lathyrus sativus, local name guaya) during a period of drought and famine. He consumed a similar diet as his mother and three sisters, but of overall smaller amounts of guaya for them. During that time, several similar cases of weakness among young male farmers occurred in his village. He migrated with another young male farmer from his village who also had weakness of both legs and arms developed during the same period of drought. No history of cassava exposure in the region.",
  "vitals": "Not mentioned",
  "physical_exam": "An alert young man with a normal mental state. The gait is spastic ('scissor gait'), with foot-dragging and toe-scraping. There is mild bilateral lower limb spastic weakness of pyramidal pattern, with pathological brisk deep tendon reflexes and sustained foot clonus. Extensor plantar response is elicited on the right, while equivocal on the left. Cranial nerves and upper limbs are normal. There is no sensory or bladder dysfunction.",
  "labs_and_diagnostics": "Full blood count, liver and renal function tests, cerebrospinal fluid, nerve conduction studies and electromyography are normal. His HIV-1 serology is non-reactive. HTLV-1 and -2 serology and MRI are not available.",
  "differential_diagnosis": "Upper motor neuron lesion with spastic paraparesis was considered. Compressive, hereditary, infectious, and metabolic myelopathies were ruled out due to absence of radicular symptoms, sensory level, sphincter disturbance, back pain, non-progression, HIV-seronegativity, and negative family history. HTLV-associated myelopathy (HAM) was considered highly unlikely due to insidious onset and slow progression, prominent bladder impairment, and sensory symptoms typical of HAM. Neurocassavism (konzo) was considered improbable due to absence of cassava exposure. Neurolathyrism was favored given male gender, pre-onset physical exertion, excessive prolonged guaya consumption, and history of similarly affected village members.",
  "management_and_clinical_course": "The patient received physiotherapy and muscle relaxants, which achieved only mild, short-lasting improvement of his spasticity. A walking cane and wheelchair were provided. He was counselled to avoid further consumption of L. sativus.",
  "final_diagnosis": "Neurolathyrism",
  "disease_name_short": "Neurolathyrism"
}