{
  "patient_information": "56-year-old male from Peru",
  "chief_complaint": "2-week history of fever, jaundice and confusion.",
  "history_of_present_illness": "Daily fever started 3 months after leaving a rural area in the highlands of northern Peru (altitude of 2400m), where the patient spent 3 weeks on vacation. In the second week of illness the patient noticed dark urine and jaundice, and few days before admission his wife noticed confusion and somnolence. Past medical history is unremarkable.",
  "exposure_and_epidemiology": "Visited a rural area in the highlands of northern Peru (altitude of 2400m) for 3 weeks. While in the rural area, the patient and his wife were bitten at night by tiny mosquitoes; no personal protection was used. No animal contact.",
  "vitals": "Blood pressure: 90/60mmHg, Pulse: 110bpm (regular), Temperature: 39.2°C (102.6°F), Respiratory rate: 22 breaths per minute.",
  "physical_exam": "Patient appears confused and disorientated without any focal neurological findings or meningeal signs (GCS 14/15). Skin and conjunctivae are markedly pale and there is scleral jaundice. Cardiovascular and pulmonary examination are normal. The liver is slightly enlarged but there is no splenomegaly.",
  "labs_and_diagnostics": "Creatinine, electrolytes and alkaline phosphatase are normal. Coomb’s test is negative. CSF results are normal. CT scan of the brain is normal. Abdominal ultrasound reveals hepatomegaly, but no focal lesions. Blood results: WBC 14.9 x 10^9/L (Ref 4–10), Neutrophils 13.1 x 10^9/L (Ref 1.8–7.2), Lymphocytes 0.9 x 10^9/L (Ref 1.5–4), Band forms 4% (Ref 0–5), Haemoglobin 6 g/dL (Ref 13–15), Reticulocytes 8% (Ref 0.5–1.5), Platelets 454 x 10^9/L (Ref 150–350), LDH 1500 U/L (Ref <250), Total bilirubin 239 μmol/L (Ref <19), Direct bilirubin 103 μmol/L (Ref <5). Blood films were negative for malaria. Thin film revealed massive red blood cell infestation by pleomorphic cocco-bacillary structures compatible with B. bacilliformis. Blood cultures were negative, including cultures in special media for Bartonella.",
  "differential_diagnosis": "Malaria (Plasmodium vivax), Bartonellosis, Rickettsial diseases (endemic and epidemic typhus), Leptospirosis, Typhoid fever, Brucellosis, Viral diseases (viral hepatitis, yellow fever), Non-infectious causes of haemolysis.",
  "management_and_clinical_course": "Patient progressed to shock, transferred to ICU and required vasopressors. Started on intravenous ciprofloxacin and ceftriaxone for 10 days. Altered mental status resolved after 3 days of antimicrobial treatment. Fever subsided after 5 days. By day 4, bacteria had disappeared from blood smears. No further complications observed during a 3-month follow-up period.",
  "final_diagnosis": "Bartonellosis (Oroya Fever) caused by Bartonella bacilliformis.",
  "disease_name_short": "Bartonellosis (Oroya Fever)"
}