{
  "patient_information": "A 62-year-old male Thai police sergeant major from Kalasin Province in northeast Thailand.",
  "chief_complaint": "Discovery of a solitary liver mass during an annual physical check-up via abdominal ultrasonography.",
  "history_of_present_illness": "Asymptomatic; patient denies any clinical symptoms, weight loss, jaundice, or other gastrointestinal symptoms.",
  "exposure_and_epidemiology": "From Kalasin Province in northeast Thailand, an area where eating raw or undercooked freshwater fish (which frequently contains metacercariae of Opisthorchis viverrini) is common. He has a past medical history of liver fluke infection and praziquantel treatment within the last 10 years.",
  "vitals": "Normal.",
  "physical_exam": "Appears in good health. No jaundice, non-palpable liver and spleen. No liver stigmata or lymphadenopathy detected.",
  "labs_and_diagnostics": "**Imaging:**\n- **Abdominal Ultrasonography:** Solitary mass in the liver (initial finding).\n- **Abdominal MRI:** Single solid liver mass in the right liver lobe (segments VI/VII), 9x9 cm, without marked bile duct dilatation.\n\n**Laboratory Results (Table 80.1):**\n- AST: 26 U/L (Ref: 4–36)\n- ALT: 32 U/L (Ref: 12–32)\n- ALP: 84 U/L (Ref: 42–121)\n- Total bilirubin: 0.6 mg/dL (Ref: 0.3–1.5)\n- Direct bilirubin: 0.2 mg/dL (Ref: 0.0–0.5)\n- HBsAg (MEIA): Negative\n- Anti-HBs (ELISA): 24.13 IU/L (Ref: 0.0–10.0) - suggests previous Hepatitis B infection\n- HBeAg (ELISA): Negative\n- Anti-HBc (ELISA): Positive (Ref: Negative) - suggests previous Hepatitis B infection\n- Anti-HCV: Negative\n- AFP: 2.8 U/mL (Ref: 0.0–10.0)\n- CEA: 18.96 μg/L (Ref: 0.0–2.5) - elevated\n- CA19-9: 342.80 U/mL (Ref: 0.0–37.0) - markedly elevated\n\n**Surgical/Histopathological Findings:**\n- **Gross:** Large (9x9 cm), whitish-yellowish tumor in the right liver lobe (segment VII/VIII).\n- **Microscopic:** Infiltrative compact glandular structures, lined by dysplastic columnar cells with necrosis, confirming intrahepatic CCA. Liver parenchyma appeared non-cirrhotic. Liver flukes (Opisthorchis viverrini) were detected in the adjacent dilated bile duct.",
  "differential_diagnosis": "Hepatocellular carcinoma, cholangiocarcinoma (CCA), metastatic tumor, and infections (including tuberculosis). Cholangiocarcinoma is considered the most likely diagnosis given the high serum CA19-9 level in an asymptomatic patient without signs of chronic viral hepatitis; metastatic cancer also considered.",
  "management_and_clinical_course": "Patient was admitted and underwent hemihepatectomy. Started on postoperative chemotherapy.",
  "final_diagnosis": "Intrahepatic Cholangiocarcinoma (CCA) associated with Opisthorchis viverrini liver fluke infection.",
  "disease_name_short": "Cholangiocarcinoma (CCA)"
}