{
  "patient_information": "A 21-year-old male migrant from rural Mali, referred to the tropical medicine department in Germany. He arrived in Germany 1 year prior to presentation. He comes from a poor family and was unable to read and write at the time of initial presentation. Clinically, he appears quite well.",
  "chief_complaint": "Intermittent fever and a feeling of 'heaviness' on the left side of his abdomen due to massive splenomegaly. He had previously been worked up for splenomegaly and bicytopenia at the haematology department without establishing an underlying condition.",
  "history_of_present_illness": "Symptoms of intermittent fever and abdominal heaviness have been present for some time, with the duration being difficult to specify. There were no night sweats, and his weight appeared to be stable. He had undergone a prior work-up for splenomegaly and bicytopenia where the underlying condition could not be established.",
  "exposure_and_epidemiology": "Migrated from rural Mali to Germany, arriving 1 year prior. His journey involved crossing Niger and spending a few weeks at a detention centre in Libya, then traveling across the Mediterranean and through Italy to Germany. Rural Mali is an area with stable malaria transmission.",
  "vitals": "Temperature: 36.1°C (96.98°F), Blood Pressure: 120/80 mmHg, Pulse: 64 bpm.",
  "physical_exam": "A 21-year-old young man who appeared clinically well. The spleen was massively enlarged, palpable around 15 cm below the left costal margin. There was no clinical anaemia and no lymphadenopathy. Heart sounds were clear with no murmurs. The rest of the examination was normal.",
  "labs_and_diagnostics": "Abdominal Ultrasound: Spleen 21.8 cm in longitudinal diameter with homogenous parenchyma. Liver normal in size and parenchyma appearance. Normal flow of portal and splenic veins. No lymphadenopathy and no free fluid. \nLaboratory Results: WBC 3.3 x 10^9/L (Reference: 4–10), Neutrophils 2.29 x 10^9/L (Reference: 1.8–7.2), Lymphocytes 1.4 x 10^9/L (Reference: 1.5–4), Monocytes 0.28 x 10^9/L (Reference: 0.2–0.5), Eosinophils 0.12 x 10^9/L (Reference: <0.5), Haemoglobin 13.8 g/dL (Reference: 13–15), Platelets 124 x 10^9/L (Reference: 150–350), LDH 185 U/L (Reference: <220), Total bilirubin 0.5 mg/dL (Reference: 0.2–1.2), IgM 8.59 g/l (Reference: 0.4–2.3), CRP 0.5 (Reference: <0.5), ESR 9/21 mm/h (Reference: <15/30). Plasmodium spp. (thick and thin film) negative. P. falciparum IFAT (malaria serology) 1:256 (Reference: <1:32).\nAdditional diagnostics: HIV serology negative, EBV and CMV serologies indicated previous infection, serologies for schistosomiasis negative, serologies for leishmaniasis negative, blood culture did not yield any pathogens, no ova of S. mansoni found in stool, PCR for P. falciparum positive.",
  "differential_diagnosis": "Lymphoma or leukaemia, Visceral leishmaniasis (VL), Schistosomiasis (chronic S. mansoni infection), Bacterial endocarditis, Brucellosis, EBV and CMV infections, Hyperreactive malarial splenomegaly (HMS).",
  "management_and_clinical_course": "Initial recommendations included HIV test, serologies for schistosomiasis and visceral leishmaniasis, blood cultures for Brucella and bacterial endocarditis, malaria PCR, and antimalarial treatment for HMS. If splenomegaly remained unexplained, a bone marrow aspirate was suggested.\nActual management: HIV serology negative; EBV and CMV serologies indicated previous infection; serologies for schistosomiasis and leishmaniasis were negative; blood culture yielded no pathogens; no ova of S. mansoni found in stool. Despite negative blood film, PCR for P. falciparum came back positive. The patient received one single course of dihydroartemisinin/piperaquine. Reported episodes of fever subsided. Malaria PCR was positive at 2-week follow-up but has remained negative since. A medical letter was issued preventing deportation due to high risk of splenic rupture. The patient was monitored for 2.5 years; IgM levels normalized after 2 years; spleen size slowly decreased but remained slightly enlarged (14 cm in diameter) at last visit. The patient was well, spoke fluent German, went to school, learned to read and write, and planned vocational training.",
  "final_diagnosis": "Hyperreactive Malarial Splenomegaly (HMS).",
  "disease_name_short": "Hyperreactive Malarial Splenomegaly (HMS)"
}