{
  "patient_information": "45-year-old male security guard, married with three children who are well, resides in urban area, unemployed for last 6 months due to illness, non-smoker, drinks two paper cartons (about one litre) of Chibuku per day, HIV-positive (diagnosed during admission), no past history of tuberculosis or trauma.",
  "chief_complaint": "Back pain and progressive difficulty in walking.",
  "history_of_present_illness": "Troubles started 1 year earlier with back pain, presented to local health centre and given paracetamol. Pain did not improve, over following weeks developed difficulty walking and pins and needles in legs. Three months later presented again with slight fever 37.5°C, given antimalarials, single dose praziquantel and paracetamol. Consulted traditional healer who applied tattoos to chest and back. Over following 6 months condition deteriorated and became bedridden. Denies fever, night sweats, weight loss, chronic cough, haematuria, diarrhoea, and is continent for stool and urine.",
  "exposure_and_epidemiology": "Urban resident in Malawi, worked as security guard, no history of travel or specific exposures mentioned, but in region endemic for TB, schistosomiasis, and HIV.",
  "vitals": "Afebrile with normal vital signs.",
  "physical_exam": "Looks well. Tenderness over lower thoracic spine, severe spasticity of both legs, power 1/5 in legs, deep tendon reflexes exaggerated in lower limbs, plantar reflexes upgoing, sensory level for pain and temperature between T9 and T11, diminished joint sense in big toes bilaterally. Cranial nerves and upper limbs normal.",
  "labs_and_diagnostics": "Full blood count normal. HIV-positive. Urine dipstick normal, no ova of Schistosoma spp. in urine or stool. Spinal radiograph showed collapse of T11 vertebral body and soft tissue swelling. Chest radiography normal. Abdominal ultrasound examination normal. CD4 count 331 cells/μL.",
  "differential_diagnosis": "Spinal cord disease: compressive causes including spinal TB (Pott’s disease), spinal metastases, degenerative spinal disease; non-compressive causes including schistosomiasis, autoimmune transverse myelitis, HIV-associated vacuolar myelopathy. Spinal TB supported by xray findings and endemic setting.",
  "management_and_clinical_course": "Presumed diagnosis of spinal TB, started on standard first-line antituberculous treatment and vitamin B6. Physiotherapy and intensive guardian counselling initiated. Reviewed by spinal surgeon who did not recommend surgery. Discharged home with palliative care team involvement for monthly home visits. At 4 weeks follow-up, neurological deficits unchanged, started on antiretroviral therapy. At 3-month follow-up, subjective improvement in gait but clinically unchanged, taking medications regularly, waiting for wheelchair.",
  "final_diagnosis": "Spinal tuberculosis (Pott’s disease) caused by Mycobacterium tuberculosis, presumed based on clinical presentation, spinal radiograph showing vertebral collapse and soft tissue swelling, and response to antituberculous treatment in an HIV-positive patient. Alternatives ruled out by negative schistosoma tests, normal ultrasound, and no evidence of neoplasia.",
  "disease_name_short": "Spinal tuberculosis"
}