{
  "patient_information": "35-year-old Malawian woman, divorced with three children aged 17, 15, and 12 years, who are all well. She works as a small-scale farmer and sells vegetables at the local market. No comorbidities or immunosuppression reported beyond newly diagnosed HIV. No vaccination or allergy information stated.",
  "chief_complaint": "Fever and weakness for 3 days, with progressive weakness over several months.",
  "history_of_present_illness": "The fever started 3 days earlier, accompanied by progressive weakness over the past several months. She reports some weight loss but no cough, night sweats, diarrhea, dysuria, or history of abnormal bleeds. Two months prior, she was prescribed iron tablets for pallor but her weakness progressed. She does not report any other abnormalities.",
  "exposure_and_epidemiology": "The patient is from Malawi, living in a high-prevalence HIV setting in sub-Saharan Africa. She is a small-scale farmer with access to three meals a day, occasionally including meat or fish. No specific travel, vector, animal, water/food risks, or sick contacts mentioned.",
  "vitals": "Blood pressure 90/60 mmHg, pulse 110 bpm, temperature 37.8°C (100°F), respiratory rate 25 breath cycles per minute, oxygen saturation 97% on ambient air, Glasgow Coma Scale 15/15.",
  "physical_exam": "Wasted appearance with body mass index 17 kg/m². Very pale conjunctivae without jaundice. Normal mouth examination with no oral thrush, Kaposi’s sarcoma lesions, or oral hairy leukoplakia. Clear chest. Soft abdomen with slight diffuse tenderness but no guarding. Spleen palpable 3 cm below the left costal margin. Normal rectal examination.",
  "labs_and_diagnostics": "Malaria rapid diagnostic test negative. HIV serology positive. Full blood count: WBC 3.0 ×10^9/L, haemoglobin 4.8 mg/dL, MCV 90 fL, platelets 112 ×10^9/L. Blood cultures grew Salmonella enterica var Typhimurium. TB screening revealed prominent hilar lymph nodes.",
  "differential_diagnosis": "Suspected sepsis without clear focus in a newly HIV-positive patient, suggesting advanced immunosuppression and possible tuberculosis. Invasive non-typhoidal Salmonellae (iNTS) is most likely due to abdominal tenderness and splenomegaly. Enteric fevers are less common in HIV-positive patients. Severe anaemia likely from bone marrow infection with HIV, Salmonellae, and possibly Mycobacterium tuberculosis. Visceral leishmaniasis considered but unlikely due to lack of gross hepatosplenomegaly and non-endemic in Malawi.",
  "management_and_clinical_course": "Intravenous fluids and broad-spectrum antibiotics (ceftriaxone 2 g once daily) initiated after blood cultures. Antibiotic changed to oral ciprofloxacin 500 mg three times daily for 14 days upon culture results. Antituberculous treatment, antiretroviral therapy, co-trimoxazole prophylaxis, vitamin B6, and therapeutic feeding started. Discharged after 4 weeks. On 3-month review, she felt better, gained weight, haemoglobin improved. Children tested HIV-negative; ex-husband refused testing.",
  "final_diagnosis": "Invasive non-typhoidal Salmonellae (iNTS) infection due to Salmonella enterica var Typhimurium, confirmed by blood culture growth, in a patient with newly diagnosed HIV and concomitant tuberculosis evidenced by hilar lymph nodes and response to treatment. The diagnosis fits the septic presentation, anaemia, and epidemiological context in sub-Saharan Africa. Alternatives like enteric fever and visceral leishmaniasis were ruled out by culture results and lack of supporting features.",
  "disease_name_short": "Invasive non-typhoidal salmonellosis"
}