{
  "patient_information": "A 33-year-old male refugee from Afghanistan, currently in Germany for 4 months. He travelled from Afghanistan with his wife and two children, lived in a refugee camp in Iran, and then crossed Turkey and Eastern Europe.",
  "chief_complaint": "6-month history of recurrent fever, night sweats, and progressive back pain.",
  "history_of_present_illness": "The patient started feeling ill about 6 months ago while living in a refugee camp in Iran. His symptoms included recurrent fever, night sweats, and progressive back pain. He received treatment with tablets and intragluteal injections for several weeks, which led to a subsidence of symptoms, but they recurred after the treatment ended. After leaving Iran, the family traveled through Turkey and Eastern Europe, reaching Germany 4 months prior to presentation. All medical documents were lost during the journey.",
  "exposure_and_epidemiology": "Refugee from Afghanistan, a country known to be highly endemic for spinal brucellosis. He lived in a refugee camp in Iran where his symptoms began. Brucellosis is a common zoonotic bacterial infection, with B. melitensis being the most common cause worldwide, often transmitted through consumption of unpasteurized dairy products or exposure to animal fluids/aerosols.",
  "vitals": "Normal.",
  "physical_exam": "Patient is afebrile and in fair general condition. Marked spinal tenderness in the lumbar region was noted. The remaining examination was unremarkable.",
  "labs_and_diagnostics": "Differential blood count, liver and renal function tests, and LDH were normal. C-reactive protein was slightly raised at 26 mg/L (<5 mg/L) and erythrocyte sedimentation rate was slightly raised at 40 mm/hour (<20 mm/hour). Urinalysis was unremarkable. MRI of the spine revealed signal enhancement of the L3 and L4 vertebral bodies, the corresponding vertebral disc, and the right psoas muscle, along with disc space narrowing and irregularities of both adjacent vertebral endplates, consistent with spondylodiscitis of L3/L4 with involvement of the psoas muscle. A chest x-ray showed no abnormalities. Several blood cultures were taken but remained negative. Sputum samples were negative for acid-fast bacilli. A CT-guided biopsy of the lesion was performed. Culture of the tissue sample revealed Brucella melitensis as the causative agent. No additional sites of infection were identified on imaging. Echocardiography showed no sign of endocarditis. A second MRI at the end of treatment showed full resolution of the paravertebral abscess.",
  "differential_diagnosis": "Infectious spondylitis, Tuberculosis (main cause globally), Spinal brucellosis (especially in highly endemic countries like Afghanistan), Staphylococcus aureus, pyogenic and non-pyogenic streptococci, Gram-negative bacteria (e.g., Salmonella species), Histoplasmosis, Actinomycosis, Melioidosis.",
  "management_and_clinical_course": "The patient's presentation was classified as 'complicated brucellosis' with spondylitis and para-vertebral abscess formation. He was treated with a combination of doxycycline 100 mg twice daily and rifampicin 900 mg daily for 16 weeks. Additionally, intramuscular streptomycin (1 g daily) was administered for the first 3 weeks of treatment. The fever subsided after several days, and inflammation parameters returned to normal within several weeks after initiating antimicrobial therapy. A follow-up MRI at the end of treatment showed full resolution of the paravertebral abscess. One year post-treatment completion, the patient showed no signs of relapse.",
  "final_diagnosis": "Complicated brucellosis with spondylitis and para-vertebral abscess formation (caused by Brucella melitensis).",
  "disease_name_short": "Brucellosis"
}