{
  "patient_information": "A 37-year-old woman from the Lower Shire Valley in southern Malawi. She lives and works on a large sugar plantation. She is married with three children, all well. Her past medical history is unremarkable. She has not taken any regular painkillers and does not drink any alcohol. An HIV test done 3 months previously was negative.",
  "chief_complaint": "Haematemesis (vomiting blood) three times over the past 24 hours. The blood is bright red in colour.",
  "history_of_present_illness": "Presented with three episodes of bright red haematemesis over 24 hours. There is no epigastric pain and no previous history of vomiting. There is no history of fever or abnormal bleeding, and her stool has been normal in colour. Before the onset of symptoms, she was fine. She has not taken any regular painkillers and does not drink any alcohol.",
  "exposure_and_epidemiology": "From the Lower Shire Valley in southern Malawi. Lives and works on a large sugar plantation in the area. Malawi and other countries in the region are highly endemic for schistosomiasis, with virtually all water bodies in the country infested with both Schistosoma mansoni and S. haematobium.",
  "vitals": "Blood pressure 90/60mmHg, pulse 110bpm, respiratory rate 28 breath cycles per minute, afebrile.",
  "physical_exam": "Slim but not wasted. Conjunctivae are slightly pale, but there are no subconjunctival effusions and she is not jaundiced. On examination of the abdomen, there is no abdominal distension and no tenderness. The spleen is palpable at 10cm below the left costal margin. The liver is slightly enlarged but there are no stigmata of chronic liver disease. There is no shifting dullness and no peripheral oedema. Her lymph nodes are not enlarged. The rest of the physical examination is normal.",
  "labs_and_diagnostics": "Laboratory results on admission showed pancytopenia with normocytic anaemia: WBC 2.8 x 10^9/L (Ref: 4–10), Haemoglobin 8.3 g/dL (Ref: 12–14), MCV 88 fL (Ref: 80–99), Platelets 130 x 10^9/L (Ref: 150–400). Further investigations included gastroduodenoscopy which confirmed the presence of oesophageal varices and found no other source of bleeding. Hepatitis B and C serologies were negative. One stool sample for S. mansoni ova was negative. Ultrasound of the liver described a pattern typical of pipestem fibrosis.",
  "differential_diagnosis": "Most likely cause of haematemesis is gastro-oesophageal varices due to portal hypertension, especially given the splenomegaly and pancytopenia. Less likely etiologies of gastrointestinal bleeding include peptic ulcer disease, erosive gastritis, a bleeding tumour, or oesophageal cancer (which typically presents with dysphagia). Visceral leishmaniasis (VL) was considered due to splenomegaly and pancytopenia but deemed less likely due to absence of fever, only slightly diminished platelet count, and its uncommonness in Southern Africa. Other causes of liver cirrhosis (e.g., chronic viral hepatitis, alcohol abuse, autoimmune hepatitis, primary biliary cirrhosis, primary sclerosing cholangitis, haemochromatosis, Wilson’s disease) were also considered.",
  "management_and_clinical_course": "The patient received IV fluids and was taken to the nearest central hospital for endoscopy. Oesophageal varices were confirmed, and banding was performed. She received a single dose of praziquantel 40mg/kg. She was discharged home.",
  "final_diagnosis": "Hepatosplenic Schistosomiasis with gastro-oesophageal varices leading to haematemesis.",
  "disease_name_short": "Hepatosplenic Schistosomiasis"
}