{
  "patient_information": "12-year-old boy with no reported comorbidities or immunosuppression. No vaccination or allergy information stated.",
  "chief_complaint": "Painful, watery, red eyes for 2 months.",
  "history_of_present_illness": "The patient reports painful, watery, red eyes for 2 months, worse in the sun, struggling to keep eyes open. Six months prior, he had less severe symptoms treated with tetracycline eye ointment without improvement. He then used juice extracts from the ecucuka plant (Aloe vera species) from a traditional healer, leading to severe eye pain, discharge, redness, and near blindness.",
  "exposure_and_epidemiology": "Lives in rural Loima, Turkana County, north-west Kenya, a hot, dusty, dry area. Fetches water from a dried riverbed 6 km away. Helps with herding and watering cows and sheep. Pastoralist community with potential for poor sanitation and overcrowding.",
  "vitals": null,
  "physical_exam": "Systemically well. Visual acuity: left eye 6/60, right eye hand movements only. Right eye: fibrotic lids with loss of architecture, tightening of palpebral aperture, loss of lower lid lashes, misdirected upper lid lashes (trichiasis), severely inflamed conjunctiva with >5 follicles on eversion, scarring of upper tarsal conjunctiva, diffuse corneal opacification with central thinning and irregular surface, fibrovascular pannus on upper cornea. Left eye: swollen lids with mucus deposits, misdirected eyelashes, eversion of lower lid margin, inflamed conjunctiva with >5 follicles and scarring, focal inferocentral corneal scars with one adherent iris indicating previous perforation, thin central cornea, shallow anterior chamber, distorted pupil towards the leucoma.",
  "labs_and_diagnostics": null,
  "differential_diagnosis": "Corneal and conjunctival damage from traditional eye medicine, supported by worsening after aloe vera application. Trachomatous trichiasis, fitting all clinical criteria including follicles, scarring, pannus, and trichiasis. Vitamin A deficiency, considered due to potential malnutrition in rural setting but no specific evidence like dietary history or blood retinol levels reported.",
  "management_and_clinical_course": "Admitted and given oral azithromycin and oral vitamin A supplements. Referred to ophthalmologist for lid surgery to address trichiasis and conjunctival flap to seal corneal defect. No further course details provided.",
  "final_diagnosis": "Bilateral trachomatous trichiasis (TT) and corneal opacity (CO) due to Chlamydia trachomatis, with a left perforating corneal ulcer, diagnosed clinically by meeting all five trachoma criteria: tarsal conjunctival follicles, scarring, limbal follicles or Herbert’s pits (implied), fibrovascular pannus, and trichiasis. Exacerbated by traditional medicine use. Vitamin A deficiency and other causes ruled out by trachoma-specific features and endemic setting.",
  "disease_name_short": "Trachoma"
}