{
  "patient_information": "A 28-year-old woman from eastern Sierra Leone.",
  "chief_complaint": "6-day history of fever, weakness, sore throat, retrosternal chest pain, and loose stools twice a day for 2 days. Developed conjunctivitis, cough, and breathlessness on the second day after admission.",
  "history_of_present_illness": "A 28-year-old woman presented to a small rural hospital in eastern Sierra Leone with a 6-day history of fever, weakness, sore throat, and retrosternal chest pain. She had loose stools twice a day for the past 2 days. She was seen in a local health post the day before admission and given artemether with amodiaquine and amoxicillin, but her condition worsened. Her initial examination was unremarkable except for mild pharyngitis. On arrival in hospital, she was treated with IV ceftriaxone and completed her antimalarial medications, though her malaria slide was negative. She remained on this treatment for 2 days but continued to deteriorate. On the second day after admission, she developed conjunctivitis. By this stage, she was very unwell and unable to walk unaided, having also developed a cough and breathlessness.",
  "exposure_and_epidemiology": "Patient is from eastern Sierra Leone, an area where Lassa fever is common (accounting for 16–20% of hospital admissions). Lassa fever is a zoonosis transmitted by Mastomys rats, usually through contact with infected rat urine. It is common in rural areas of sub-Saharan West Africa.",
  "vitals": "Axillary temperature 38.2°C (100.8°F), blood pressure 80/55 mmHg, pulse rate 100 bpm.",
  "physical_exam": "Initial examination showed mild pharyngitis. Later developed conjunctivitis and was very unwell, unable to walk unaided. Chest auscultation revealed bilateral fine crepitations.",
  "labs_and_diagnostics": "Malaria slide was negative. Chest radiograph revealed diffuse bilateral infiltrates. Blood chemistry showed mild renal impairment and raised transaminases (AST/GOT 514 U/L (<50 U/L)). Diagnosis of Lassa fever was confirmed with antigen testing. Serological and PCR tests are also available for Lassa fever diagnosis.",
  "differential_diagnosis": "Adenovirus infections, Measles, Mycoplasma pneumoniae, Other forms of pneumonia, Leptospirosis, Typhoid, Lassa fever.",
  "management_and_clinical_course": "Initially treated with artemether with amodiaquine and amoxicillin at a local health post, then IV ceftriaxone and antimalarials in hospital, with no improvement. Management involved isolation with strict infection control precautions (goggles, masks, double gloves, disposable gowns) due to suspected viral haemorrhagic fever. Post-exposure prophylaxis with oral ribavirin was considered for staff in case of occupational exposure. The patient received IV ribavirin in a specialist isolation unit after Lassa fever was confirmed by antigen testing. Unfortunately, she was already very unwell and died 2 days later. Contact tracing was performed for family, friends, and medical staff, with advice to monitor temperature and seek medical help if unwell within 21 days.",
  "final_diagnosis": "Lassa fever (confirmed by antigen testing).",
  "disease_name_short": "Lassa Fever"
}