{
  "patient_information": "A previously healthy 20-year-old male from southern India.",
  "chief_complaint": "Fever and quadriparesis.",
  "history_of_present_illness": "Fever for 4 days, followed by tingling and weakness initially in his left leg, subsequently involving all four limbs over the next 2 days.",
  "exposure_and_epidemiology": "History of a stray dog bite (WHO category III) on his left lower limb 1 month before onset of symptoms. Received five doses of anti-rabies vaccine (purified chick embryo cell vaccine), but no rabies immunoglobulin (RIG). From a rabies-endemic country (India).",
  "vitals": "Blood pressure: 110/70 mmHg, Pulse: 90 beats per minute, Respiratory rate: 26 breaths per minute, Temperature: 38.5°C (101.3°F).",
  "physical_exam": "Conscious, mental functions normal (GCS 15/15). Neurological examination revealed a flaccid, areflexic quadriparesis. Later developed autonomic instability (increased perspiration, variability in heart rate and blood pressure), dysphagia.",
  "labs_and_diagnostics": "Blood investigations (serum electrolytes, renal and liver function test) were normal. CSF showed 52 mg/dL protein (reference: 15–50mg/dL), 60 mg/dL glucose (reference: 50–75mg), and 340 cells/mm3 (60% polymorphs and 40% lymphocytes; normal < 5 cells/mm3). Saliva sample collected at admission was positive for rabies viral RNA by RT-PCR; CSF sample was negative.",
  "differential_diagnosis": "Guillain Barré Syndrome, Post-vaccination encephalomyelitis, NMDAR antibody-mediated/Autoimmune encephalitis, Campylobacter-associated summer paralysis syndrome, Cerebral malaria, Herpes simplex encephalitis, Arthropod-borne encephalitides (e.g. Japanese encephalitis, West Nile Virus encephalitis, etc.), Poliomyelitis, B-virus (Cercopithecine herpesvirus 1) encephalomyelitis, Tetanus, Snake- or Scorpion-envenomation, Organophosphate poisoning, Illicit drug use, CNS intoxicants, Psychiatric disorders.",
  "management_and_clinical_course": "Developed autonomic instability, dysphagia, and respiratory distress requiring mechanical ventilation on the third day of hospitalization. Patient died due to sudden cardiac arrest on the fifth day of hospitalization (9 days post-onset of symptoms).",
  "final_diagnosis": "Paralytic Rabies.",
  "disease_name_short": "Rabies"
}