{
  "patient_information": "A 32-year-old man from Malawi.",
  "chief_complaint": "Pain in the right upper abdomen and a feeling of faintness.",
  "history_of_present_illness": "Well until 1 month previously, then experienced a feeling of fullness in his upper abdomen. In the week before admission, he developed pain in the right upper abdomen, particularly apparent when sleeping on his right side. Recently started to feel breathless on lying down and faint, especially on standing up. Past medical history includes an episode of a blistering and painful skin lesion on the right side of his abdomen 3 years previously, which healed spontaneously after several weeks.",
  "exposure_and_epidemiology": "Patient is from Malawi. A previous attack of herpes zoster is a strong pointer to HIV infection. In Africa, common causes of pericardial effusion include tuberculosis, other bacterial infections, malignancy, and HIV-related Kaposi’s sarcoma. There is a strong association between tuberculosis and HIV infection in central and southern Africa.",
  "vitals": "Pulse regular at 130bpm with pronounced pulsus paradoxus measured at 15mmHg. Blood pressure (supine) 90/60mmHg.",
  "physical_exam": "Thin and slightly breathless in the supine position. Jugular venous pulse appears elevated. Apex beat impalpable. Heart sounds quiet but audible; no triple rhythm, no heart murmurs. Auscultation of the chest normal. Enlarged tender palpable liver measured at 8cm below the right costal junction. Mild peripheral oedema of the legs and sacral area.",
  "labs_and_diagnostics": "Haemoglobin 10.5g/dL; WBC 9.8 G/L. Chest radiography showed an enlarged globular heart with clear lung fields. Therapeutic pericardial aspiration performed, 500mL of bloodstained pericardial fluid were aspirated. HIV testing was carried out and the patient was found to be HIV positive.",
  "differential_diagnosis": "Cardiac decompensation associated with right heart failure. Potential causes of pericardial effusion in Africa include tuberculosis, other bacterial infections, malignancy, and HIV-related Kaposi’s sarcoma.",
  "management_and_clinical_course": "Underwent therapeutic pericardial aspiration, which immediately increased blood pressure to 120/80mmHg. Started on standard first-line antituberculous treatment (rifampicin, isoniazid, pyrazinamide, ethambutol) and prednisolone 60mg daily. Received a full 6-month course of antituberculous treatment (2-month initial phase of four drugs, 4-month continuation phase of two drugs), prednisolone in tapered doses for ten weeks, and antiretroviral therapy started 4 weeks after commencing antituberculous treatment. Made a full and uneventful recovery.",
  "final_diagnosis": "Pericardial tamponade caused by a large pericardial effusion, most likely due to HIV-associated tuberculosis.",
  "disease_name_short": "HIV-associated tuberculosis"
}