{
  "patient_information": "A 58-year-old Sri Lankan woman residing in a rural area.",
  "chief_complaint": "High-grade fever, deafness (hearing loss), and confusion.",
  "history_of_present_illness": "A 58-year-old Sri Lankan woman who resides in a rural area presented to a local hospital with high-grade fever, chills, body aches, non-productive cough, and progressive shortness of breath for 10 days. Two days prior to admission, she developed tinnitus and hearing loss. One day prior to admission, she became increasingly confused.",
  "exposure_and_epidemiology": "Resides in a rural area in Sri Lanka.",
  "vitals": "On admission: Glasgow Coma Scale (GCS) score 13/15 (E4 V4 M5). Temperature 39.3°C (102.7°F), heart rate 120 bpm, blood pressure 90/60 mmHg.",
  "physical_exam": "On admission: Confused, hearing severely impaired (WHO grade 3). Enlarged axillary lymph nodes on the right side. No rash and no neck stiffness; Kernig’s and Brudzinski’s signs negative. Scattered crackles audible on auscultation over the bases of both lungs. Liver enlarged to 5 cm below the right costal margin and spleen just palpable.\nOn day 2 after admission: Developed coarse tremors of both upper and lower limbs associated with saccadic oscillations of her eyes in all directions with further deterioration of level of consciousness (GCS 8). A careful clinical examination revealed a well-demarcated crater-like lesion (eschar) in the right axilla hidden within the axillary folds.",
  "labs_and_diagnostics": "Blood: WBC 8.5 x 10^9/L (normal), Haemoglobin 12.4 g/dL (normal), Platelets 98 x 10^9/L (low), AST 74 U/L (high), ALT 68 U/L (high), ALP 126 U/L (normal), Total bilirubin 25.7 μmol/L (normal), Blood urea nitrogen 6.4 mmol/L (borderline high), Creatinine 123.8 μmol/L (high), C-reactive protein 48 mg/L (high).\nCerebrospinal Fluid (CSF): Leukocytes 35 cells/μL (80% lymphocytes) (high), Protein 0.64 g/L (high), Glucose 3.25 mmol/L (slightly decreased compared to serum glucose 7.17 mmol/L).\nCultures/Serologies/PCR: Blood cultures negative for organisms. Leptospira serology negative. Salmonella serology negative. Leptospira-PCR not available. Thick film for malaria parasites negative.\nImaging: Chest radiography showed no pathological changes. CT scan of the brain was normal.\nOther: ECG showed sinus tachycardia. EEG revealed widespread slowing.\nPost-treatment: O. tsutsugamushi IFA-IgG titre high (>1:4096).",
  "differential_diagnosis": "Other rickettsial infections, leptospirosis, scrub typhus (mentioned as a strong suspicion).",
  "management_and_clinical_course": "On day 2 after admission, a crater-like lesion was found, and Doxycycline therapy was commenced. The patient improved over the next 48 hours. She was discharged on day 6 after admission. Her hearing had returned to normal and there were no other neurological deficits.",
  "final_diagnosis": "Scrub typhus, supported by a high O. tsutsugamushi IFA-IgG titre (>1:4096).",
  "disease_name_short": "Scrub Typhus"
}