{
  "patient_information": "A 71-year-old Japanese man, born and living in Kyushu district, southern Japan.",
  "chief_complaint": "Referred for further work-up of a nodular lesion in his right lung, detected during a routine health check. The patient reported being clinically well and did not have any complaints.",
  "history_of_present_illness": "A linear lung lesion was first detected 2 years prior during a routine health check. The patient was regularly followed up, and at his most recent visit, chest radiography and CT scan revealed that the linear lung shadow had turned into a nodular lesion of about 2cm in diameter in the right lung.",
  "exposure_and_epidemiology": "Born and living in Kyushu district, southern Japan, an area endemic for Paragonimus species. No history of travelling overseas.",
  "vitals": "Normal.",
  "physical_exam": "Chest was clear. The remainder of the physical examination was also normal.",
  "labs_and_diagnostics": "Full blood count showed: WBC 6.5 x 10^9/L (Ref 4–10), Haemoglobin 15.3 g/dL (Ref 14–16), Platelets 190 x 10^9/L (Ref 150–300), Neutrophils 46.1% (Ref 30–80), Lymphocytes 38.6% (Ref 15–50), Monocytes 6.4% (Ref 1–12), Eosinophils 8.3% (Ref 0–6), Total eosinophil count 0.54 x 10^9/L (Ref <0.45), Basophils 0.6% (Ref 0–2). Total IgE was 185.7 U/mL (Ref <100). Liver and renal function tests, electrolytes, LDH, and CRP were normal. Serologies: Cryptococcus Ag negative, Aspergillus Ag negative, β-D-glucan 6.0pg/mL (<20pg/mL), QuantiFERON test (QFT-2G) negative. Imaging: Chest radiography and CT scan showed a nodular lesion of about 2cm in diameter in the right lung. Fluorodeoxyglucose-positron emission tomography (FDG-PET-CT) showed increased FDG-uptake into the lesion in the right upper lobe. Bronchoscopy did not reveal any signs of malignancy. Cytology of the bronchoalveolar lavage (BAL) fluid was negative for malignant cells and acid-fast bacilli. A wide range of tumour markers were negative. Multiple-dot ELISA for parasitic diseases was strongly positive for P. westermani.",
  "differential_diagnosis": "Pulmonary tuberculosis, lung cancer, pulmonary helminth infections (especially lung fluke infection/paragonimiasis).",
  "management_and_clinical_course": "Bronchoscopy and BAL cytology were performed, ruling out malignancy and acid-fast bacilli. Tumour markers were negative. Given the elevated IgE, eosinophilia, and the patient's origin from Southern Japan, paragonimiasis was strongly suspected. Immunodiagnosis via Multiple-dot ELISA confirmed P. westermani infection. The patient was treated with oral praziquantel 25mg/kg three times daily for 3 consecutive days. The lung lesion gradually faded and eventually disappeared, and his serum antibody titre declined.",
  "final_diagnosis": "Paragonimiasis (P. westermani)",
  "disease_name_short": "Paragonimiasis"
}