{
  "patient_information": "A 31-year-old woman from Tanzania. Married with 3 children (last born 12 months old). Does not smoke or take alcohol. HIV status during last pregnancy was negative.",
  "chief_complaint": "Loss of power and feeling in her legs (acute flaccid paraplegia).",
  "history_of_present_illness": "Perfectly well until 2 days prior to presentation, when she experienced acute, severe, continuous, burning back pain radiating band-like to the umbilicus, unrelieved by analgesics or position. Within 12 hours, the pain lessened, but she developed numbness in her feet and legs ascending to her waist, loss of power in her legs, and loss of bladder control. She had a febrile illness 3 weeks previously, treated as malaria. No past or family history of similar illness and no history of trauma.",
  "exposure_and_epidemiology": "From northern Tanzania. History of a febrile illness 3 weeks previously, treated as malaria.",
  "vitals": "Normal vital signs.",
  "physical_exam": "Well nourished. General examination unremarkable; no spinal tenderness, deformity, or gibbus. Neurological examination: fully orientated, normal higher mental functions, normal cranial nerves (including fundoscopy) and upper limbs. Unable to move legs. Lower limbs reveal flaccid paraparesis with a sensory level at T10. Feet in a slightly plantar-flexed position. Tone reduced bilaterally. Power reduced (MRC grade 1/5) in all muscle groups. Reflexes absent bilaterally. Plantar reflexes are extensor. Sensation reduced to light touch to the level of the umbilicus. Joint position sense impaired in feet and ankles. Vibration sense absent to the anterior iliac crest bilaterally.",
  "labs_and_diagnostics": "Full blood count, renal and liver function tests were normal. ESR: 19 mm/h (normal <10). Random blood glucose: 5.6 mmol/l (normal 3.9–11.1). HIV-Serology and p24 Antigen: negative. VDRL: negative. Schistosomiasis-serology: negative. Urine for ova of S. haematobium: negative. Stool for ova of S. mansoni: negative. Spinal tap: CSF opening pressure normal, looked clear. CSF white cell count: 11 cells/μl (90% lymphocytes) (normal 0–5). CSF protein: 1.11 g/L (normal <0.45). CSF glucose: 3.9 mmol/l (normal 2.8–3.8). Gram stain: negative. Ziehl-Neelsen stain: negative. Xpert MTB/RIF: negative. VDRL in the CSF: negative. X-rays of chest and thoracolumbar spine were normal.",
  "differential_diagnosis": "Clinical syndromic diagnosis: acute flaccid paraparesis. Neuroanatomical differential diagnoses: lesions of peripheral nerves (polyneuropathies or polyradiculoneuropathies) and acute lesions of the spinal cord (myelopathies). Lesion localized to the spinal cord (T10 level). Main differential diagnosis of acute non-compressive flaccid paraparesis localizing in the spinal cord: acute spinal cord inflammation (acute transverse myelitis) and vascular spinal cord ischaemia ('spinal stroke').",
  "management_and_clinical_course": "Management principles included establishing and treating the cause and preventing complications. Treatment involved corticosteroids and acyclovir. Counselling of patient and family, active involvement of family in physiotherapy and mobilization. General measures included strict 2-hourly turning, frequent passive movements, urinary catheterization, and adequate analgesia. Patient partially improved and was discharged after 3 weeks. Power in legs slightly improved (MRC 2-3/5) and she had a urinary catheter in situ. Scheduled for outpatient review.",
  "final_diagnosis": "Acute Transverse Myelitis (ATM).",
  "disease_name_short": "Acute Transverse Myelitis"
}