{
  "patient_information": "44-year-old male rice farmer with type 2 diabetes diagnosed 4 years prior, non-compliant with oral antidiabetic drugs and follow-up. No other comorbidities or immunosuppression mentioned.",
  "chief_complaint": "Fever, headache, generalized myalgia and arthralgia, and painful swelling over the left scapula for 1 month.",
  "history_of_present_illness": "The swelling gradually increased without preceding trauma. The lesion was incised and drained at a local health centre one week prior, followed by cloxacillin 1g four times daily, but no improvement. Deteriorated in the 2 days prior to admission with high fever, chills, and severe malaise.",
  "exposure_and_epidemiology": "Rice farmer in southern Laos during the rainy season. No specific animal, water, or food risks mentioned, but occupational exposure to soil and water implied.",
  "vitals": "Temperature 40°C (104°F), heart rate 136 bpm, blood pressure 140/80 mmHg, respiratory rate 30 breath cycles per minute.",
  "physical_exam": "Septic appearance, pale and jaundiced. Erythematous swelling of 2.5 × 4 cm over left scapula with pus discharging from central wound. No regional lymphadenopathy. Bilateral crepitations and reduced breath sounds at both lung bases. Normal heart sounds. Soft abdomen without palpable organomegaly.",
  "labs_and_diagnostics": "WBC 16.2 ×10^9/L with 92.1% polymorphs, haemoglobin 12.5 g/dL, platelets 112 ×10^9/L, glucose 20.6 mmol/L, serum creatinine 56 μmol/L, urea 6.8 mmol/L, AST 131 U/L, ALT 83 U/L, total bilirubin 111.2 μmol/L, direct bilirubin 56.4 μmol/L. Pus and blood cultures grew Burkholderia pseudomallei. Throat swabs negative. Chest radiograph showed bilateral pleural effusions. Shoulder radiograph no bony involvement. Abdominal ultrasound showed hepatosplenomegaly without liver or splenic abscesses.",
  "differential_diagnosis": "Bacterial abscess with sepsis from Staphylococcus aureus, Streptococcus pyogenes, Klebsiella pneumoniae, or anaerobes, favored by diabetes. Melioidosis due to epidemiological risks and clinical features. Tuberculosis considered for subacute abscess and respiratory findings, but less likely as abscess not 'cold'. Disseminated fungal infection unlikely without additional immunocompromise.",
  "management_and_clinical_course": "Empirically treated with ceftriaxone and gentamicin. Switched to ceftazidime after 48 hours upon suspicion of melioidosis. Improved after 7 days, afebrile by day 14, switched to oral co-trimoxazole for 20 weeks. Glycaemic control established. Discharged after 21 days, continued eradication treatment for 5 months. Remains well.",
  "final_diagnosis": "Melioidosis caused by Burkholderia pseudomallei, confirmed by positive pus and blood cultures. Supported by risk factors including diabetes, rice farming in endemic area during rainy season, and presentation with abscess, pneumonia, and sepsis. Other bacterial causes ruled out by culture results and clinical response.",
  "disease_name_short": "Melioidosis"
}