{
  "patient_information": "20-year-old female housewife, a Sudanese refugee with no reported comorbidities or immunosuppression. No vaccination or allergy information provided.",
  "chief_complaint": "Fever, severe asthenia, and abdominal pain for 2 days.",
  "history_of_present_illness": "The patient presented with a 2-day history of fever, severe asthenia, chest and abdominal pain, nausea, vomiting, diarrhea, and a slight non-productive cough. She denies any contact with sick people.",
  "exposure_and_epidemiology": "The patient is a Sudanese refugee living in a camp in northern Uganda. No specific travel, animal, water, food, or sick contact exposures were reported. The case occurred during a known Ebola virus disease outbreak in the region.",
  "vitals": "Temperature 39.6°C (103.3°F), blood pressure 90/60 mmHg, pulse 90 bpm, respiratory rate 24 cycles per minute on admission. Later, temperature dropped to 36.0°C, blood pressure became unreadable, pulse increased to 150 bpm, and respiratory rate rose to 36 cycles per minute.",
  "physical_exam": "Prostrate and semiconscious with abdominal tenderness, especially in the right upper quadrant, hepatosplenomegaly, and bleeding from the gums. Lungs were clear. No rash or lymphadenopathy was noted. Later developed subconjunctival hemorrhage and copious bleeding from the mouth, nose, and rectum.",
  "labs_and_diagnostics": "No clinical laboratory data were available due to biosafety-related suspension of routine testing. Specialized laboratory testing post-mortem showed positive ELISA antigen and PCR tests for Ebola virus and a negative result for ELISA IgG antibody.",
  "differential_diagnosis": "The differential diagnosis includes viral hemorrhagic fever (Ebola suspected due to outbreak context), complicated malaria, typhoid fever, bacterial gastroenteritis, and leptospirosis. Ebola was strongly suspected given the outbreak setting, hemorrhagic symptoms, and clinical progression, while other diagnoses were less likely without specific supporting findings.",
  "management_and_clinical_course": "Intravenous fluids, broad-spectrum antibiotics, and analgesics were initiated on admission. The patient’s condition rapidly worsened with subconjunctival hemorrhage, copious bleeding from multiple sites, dyspnea, hypothermic shock, and coma. She died approximately 24 hours after admission.",
  "final_diagnosis": "Ebola virus disease caused by Ebola virus, confirmed by positive ELISA antigen and PCR tests with a negative ELISA IgG antibody result. The diagnosis was supported by the clinical presentation of fever, hemorrhage, and shock during a known Ebola outbreak in northern Uganda. Other differential diagnoses like malaria and typhoid fever were ruled out due to confirmatory testing and lack of specific alternative findings.",
  "disease_name_short": "Ebola virus disease"
}
