{
  "patient_information": "18-year-old man, from India, right-handed.",
  "chief_complaint": "Pale patch on his right arm and forearm for 3 months, and mild numbness of the right little finger.",
  "history_of_present_illness": "Pale patch on right arm and forearm for 3 months. It is not itchy or painful, but he reports reduced sensation in the affected area. He also complains of mild numbness of the little finger of the right hand but no weakness. He is otherwise well. There is no family history of skin problems.",
  "exposure_and_epidemiology": "Patient is from India, a leprosy-endemic country. Family and friends were examined and showed no signs of leprosy.",
  "vitals": "Not mentioned",
  "physical_exam": "There is a 20 cm by 10 cm hypopigmented macule on the outer aspect of the right arm extending onto the forearm. The affected skin is dry. Sensation within the hypopigmented area is reduced compared with normally pigmented skin. The rest of the skin examination is normal. Both ulnar nerves are palpable, however the right ulnar nerve is thickened. There is reduced sensation on the tip and ulnar border of the right little finger. There are no other neurological abnormalities.",
  "labs_and_diagnostics": "No additional investigations were required because the patient had the two clinical cardinal signs of leprosy – a hypopigmented skin lesion with reduced sensation and a thickened nerve.",
  "differential_diagnosis": "Pityriasis alba, pityriasis versicolor, seborrheic dermatitis, vitiligo, non-specific sequela of inflammatory or traumatic processes (e.g., dermatitis, burn).",
  "management_and_clinical_course": "The patient was diagnosed with paucibacillary leprosy and commenced on rifampicin and dapsone for 6 months. The sensory neuropathy was treated with oral prednisolone 30 mg daily, reduced by 5 mg each month. The patient was counselled extensively about the cause of leprosy and advised how to care for his hands and avoid trauma. He made a full recovery.",
  "final_diagnosis": "Paucibacillary leprosy",
  "disease_name_short": "Leprosy"
}