{
  "patient_information": "A 46-year-old Thai woman, 158cm, 65kg (BMI 26kg/m2). Transferred to a German clinic for tropical diseases.",
  "chief_complaint": "2-month history of recurrent cutaneous and subcutaneous abscesses, progressive lymphadenopathy, and weight loss, accompanied by fever.",
  "history_of_present_illness": "The patient presented with a 2-month history of recurrent cutaneous and subcutaneous abscesses, progressive lymphadenopathy, and weight loss. Despite various antibiotic therapies, clinical symptoms and inflammatory markers deteriorated, leading to hospital admission. Initial pus and blood cultures did not yield any growth, and a lymph node biopsy showed non-specific lymphadenitis. Symptoms began 6 to 8 weeks after returning from a family visit to northern Thailand, during which she had suffered from high fever, dry cough, and fatigue. Later, while on antifungal treatment, the patient developed a generalized seizure.",
  "exposure_and_epidemiology": "Thai woman who returned from a family visit to northern Thailand 6 to 8 weeks before symptom onset. Histoplasmosis is endemic in South East Asia.",
  "vitals": "Afebrile, blood pressure 130/80mmHg, pulse 80bpm.",
  "physical_exam": "Enlarged, tender cervical, nuchal, inguinal, and axillary lymph nodes. Massive, tender swelling of the upper eyelids. Disseminated fluctuant cutaneous and subcutaneous abscesses with surrounding erythema and pus discharge on slight pressure. Painful swelling of the left elbow. Otherwise normal physical examination.",
  "labs_and_diagnostics": "Initial pus and blood cultures were negative. Histopathology of a lymph node biopsy showed non-specific lymphadenitis. Laboratory results on admission: WCC 30.8 x 10^9/L (elevated), Haemoglobin 8.2 g/dL (low), MCV 88 fL (normal), Platelets 592 x 10^9/L (elevated), CRP 267 mg/L (markedly elevated), ESR >110 mm/h (markedly elevated). Radiograph of the left elbow revealed osteolytic lesions of the radial epicondylus, osteomyelitis, and articular effusion. Fungal cells identified as Histoplasma capsulatum by PCR from a submandibular lymph node biopsy, later confirmed by culture. Serology for histoplasmosis remained negative (initially and on repeat). CSF analysis revealed lymphocytic pleocytosis.",
  "differential_diagnosis": "Systemic infection, fungal infections (e.g., histoplasmosis), mycobacterial infections, bacterial infections with specific growth requirements/antibiotic susceptibility (e.g., Burkholderia pseudomallei, Brucella species, Francisella tularensis, Actinomyces species), underlying immunodeficiency (e.g., HIV, diabetes mellitus, antibody deficiency, impaired granulocyte function), rare autoimmune syndromes (e.g., idiopathic nodular panniculitis, aseptic abscesses syndrome). Initially, melioidosis was clinically suspected.",
  "management_and_clinical_course": "Initially received various antibiotic therapies without improvement. Treated with imipenem for suspected melioidosis, which led to a slight improvement in skin manifestations but persistent elevated inflammatory markers. Subsequently treated with liposomal amphotericin B (3mg/kg per day, total dose 3g), which resulted in dramatic improvement in clinical state and laboratory findings. Started on itraconazole maintenance therapy for an additional 6 months. No evidence of immunosuppression was found during diagnostic work-up. On follow-up, the patient was in fair general condition with post-inflammatory hyperpigmentation at former abscess sites, resolution of enlarged lymph nodes, and partial recalcification of osteolytic lesions.",
  "final_diagnosis": "Disseminated Histoplasmosis, with acute pulmonary histoplasmosis retrospectively suspected during the initial illness in Thailand, and cerebral manifestation during treatment.",
  "disease_name_short": "Histoplasmosis"
}