{
  "patient_information": "A 55-year-old Swiss couple, both fitness instructors and previously healthy.",
  "chief_complaint": "Husband: Fever, myalgias, generalized weakness, and shortness of breath with oxygen desaturation. Wife: Similar complaints, cardiorespiratory failure, multi-organ failure, and profuse bleeding.",
  "history_of_present_illness": "Husband: Developed fever (39°C), myalgias, and generalized weakness on the flight back to Switzerland, which did not respond to symptomatic treatment. Four days later, presented at the hospital with persistent fever, profound weakness (unable to walk unassisted or hold a newspaper), shortness of breath with oxygen desaturation, and bilateral interstitial infiltrates on chest x-ray. Respiratory pathogen panel and HIV test were negative. The following day, he was transferred to the ICU for non-invasive ventilator support. Wife: Three weeks after her husband's admission, she presented with similar complaints and was admitted. She deteriorated rapidly over 24 hours, developing cardiorespiratory failure, fulfilling fast-entry criteria for ECMO. She also experienced multi-organ failure requiring hemodialysis and developed profuse bleeding from puncture sites in the context of disseminated intravascular coagulation, requiring mass transfusions.",
  "exposure_and_epidemiology": "The couple traveled for 3 months from Ecuador to Chile. The last month of their trip was spent hiking, camping, and taking occasional mud baths in the Chile-Argentinian border region. The mode of transmission remained unclear; both human-to-human transmission and acquisition from a common source were considered possible. Hantavirus is endemic in the border region between Chile and Argentina, with infection typically occurring through inhalation of excreta from the long-tailed pygmy rice rat, and outdoor activities being a major risk factor.",
  "vitals": "Husband (on admission): BP 90/55 mmHg, pulse 120 beats per minute, oxygen saturation 94% on ambient air, temperature 39°C (102.2°F). Wife (on admission 3 weeks after husband's admission): Normal blood pressure, heart rate, and oxygen saturation, temperature 38.6°C (101.5°F).",
  "physical_exam": "Husband: No abnormal findings on cardiopulmonary auscultation. Wife (on admission): No abnormal findings on auscultation. Later, she experienced profuse bleeding from puncture sites.",
  "labs_and_diagnostics": "Husband (on admission): WCC 7.3 G/L (reference: 3.0–10.5), 35% band neutrophils; platelets 48 G/L (reference: 150–450); CRP 68 mg/L (reference: <5); glomerular filtration rate >90 mL/min; transaminases normal. Chest x-ray showed bilateral interstitial infiltrates. Respiratory pathogen panel (including influenza A/B, parainfluenza, RSV, adenovirus, rhinovirus, bocavirus, coronavirus, human metapneumovirus) and HIV test were negative. Wife (on admission): WCC 1.88 G/L; platelets 98 G/L; CRP 7 mg/L; glomerular filtration rate >90 mL/min; transaminases normal. Chest radiography at presentation was normal, but during the course of the disease, both developed extensive bilateral infiltrates with pleural effusions. Both patients were confirmed by PCR and serology to be infected with Andesvirus (ANDV). CT chest of the wife on day 13 showed extensive and dense dorsal infiltrations.",
  "differential_diagnosis": "Conditions causing acute respiratory distress syndrome (ARDS) and possible multi-organ failure after travel to South America, including influenza and other respiratory viruses (specifically New World hantaviruses), Pneumococcal pneumonia, Rickettsial diseases (Rickettsia rickettsiae, scrub typhus), Pulmonary plague, Fungal infections (Histoplasmosis, Cryptococcosis), and severe malaria. Most viral haemorrhagic fevers (yellow fever, dengue, New World arenaviruses) were excluded based on incubation time, with hantavirus infections being the exception.",
  "management_and_clinical_course": "Husband: Initially received symptomatic treatment without response. Treated with non-invasive ventilation for 5 days. Made a full recovery after a month of rehabilitation. Wife: Experienced a dramatic course with nearly a full month on ECMO treatment. Developed multi-organ failure requiring renal replacement therapy and haemorrhagic complications necessitating mass transfusions of blood products. Due to bleeding complications at inguinal ECMO insertion sites (compartment syndrome and leg ischemia), ECMO was replaced centrally. She underwent several surgical interventions after additional bleeding complications at inguinal and thoracic insertion sites. Nosocomial infections followed. She remained in intensive care for 5 months and an additional 12 months in rehabilitation. Clinically, securing cardiorespiratory function was the main priority. Broad-spectrum antibiotics were indicated as empirical treatment. Both patients were treated under standard hygiene and droplet precautions.",
  "final_diagnosis": "Andesvirus (ANDV) infection, causing Hantavirus Cardiopulmonary Syndrome (HCPS).",
  "disease_name_short": "Hantavirus Cardiopulmonary Syndrome (HCPS)"
}