{
  "patient_information": "14-year-old male, otherwise unremarkable history. Lives in village in northern Tanzania in rural area with limited agricultural suitability, main staple food crop cassava. Diet for 2 months before illness almost exclusively cassava. Three other siblings, one similarly affected, parents fine. Identical cases in own and neighbouring villages at same time.",
  "chief_complaint": "Difficulty in walking for over 2 years.",
  "history_of_present_illness": "Well until over 2 years earlier when illness suddenly started. Walking home from school, legs felt heavy and started to tremble, difficulty walking, tendency to fall. Slowly completed journey home, since then unable to stand or walk unaided. Now stands on toes and drags legs with aid of stick. Denies fever, pain, sensory, bladder or bowel symptoms or disease progression.",
  "exposure_and_epidemiology": "Lives in cassava-growing area in rural northern Tanzania. Diet almost exclusively cassava before illness.",
  "vitals": "Normal vital signs.",
  "physical_exam": "Well nourished. Fully orientated, higher mental function normal. Cranial nerves normal, bilateral optic pallor on fundoscopy. Limbs show spastic paraparesis with flexion contractures at both ankles and knees. Power in legs 3 to 4 out of 5, knee extensors and foot dorsiflexors most involved. Bilateral hypertonia, hyperreflexia, sustained ankle clonus, extensor plantar responses. Arms normal apart from generalized hyperreflexia. No impairment or loss of sensation. Lumbar lordosis with thoracic kyphoscoliosis on standing.",
  "labs_and_diagnostics": "Full blood count, erythrocyte sedimentation rate, blood glucose, creatinine normal. Urine analysis normal. Microscopy of urine and stool no Schistosoma ova. HIV serology and VDRL negative. Lumbar puncture normal. Radiographs of chest and thoracolumbar spine normal.",
  "differential_diagnosis": "Spastic paraparesis: spinal tuberculosis (Pott’s disease), transverse myelitis, spinal cord infections like schistosomiasis and tuberculous myelitis, spinal malignancy (mainly metastases), tropical nutritional myeloneuropathies. Isolated motor involvement without sensory/bladder, no back pain, acute onset non-progressive make tuberculosis, infection, malignancy unlikely. Nutritional cause suspected due to cassava diet, affected sibling/neighbors. Tropical myeloneuropathies: konzo and lathyrism. Lathyrism in Africa exclusive to Ethiopia. Konzo in cassava-growing areas.",
  "management_and_clinical_course": "No cure, permanent spastic paraparesis. Management supportive, symptomatic, preventive. Walks with stick or crutches, some benefit from wheelchair. Muscle relaxants limited role due to ineffectiveness and cost. Surgical Achilles tendon lengthening useful in selected for mobilization. Assessed for surgery due to contractures. At 6 and 12 months follow-up, findings unchanged, permanent spastic paraparesis. Not referred for surgery due to lack of resources and epidemic extent. Uses one stick with restricted mobility, works as shoe repairer.",
  "final_diagnosis": "Konzo, a tropical spastic paraparesis, attributed to chronic high dietary cyanogenic glycosides from insufficiently processed cassava. Diagnosed clinically by symmetrical spastic paraparesis without sensory/genitourinary, abrupt onset non-progressive, in cassava-growing area with other cases. Alternatives ruled out by clinical features and investigations.",
  "disease_name_short": "Konzo"
}