{
  "patient_information": "A 42-year-old British male expatriate who has lived in Malawi for 18 months.",
  "chief_complaint": "Florid itchy rash, difficulty in breathing and a feeling he is going to die.",
  "history_of_present_illness": "Two days prior to admission, he thinks he might have been bitten on his ankle by a tick while walking in the countryside. Twenty-four hours after this event, he noticed a circumscribed, painless, indurated lesion on his left ankle, accompanied by fever and arthralgia. He went to a clinic where a malaria blood film was negative and he was treated with paracetamol. On the day of admission, he developed a widespread itchy rash, became progressively unable to breathe, and felt faint. He has a family history of allergy. He previously kept bees without ill effect from stings. Nine months prior, he had developed an asthmatic attack that resolved spontaneously over 2 days after insect bites at Lake Malawi.",
  "exposure_and_epidemiology": "Lived in Malawi for 18 months. Possible tick bite 2 days prior to admission in the countryside. Bitten by insects at Lake Malawi 9 months prior. Visited a national game park 2 weeks before current illness and suffered numerous painful bites by tsetse flies.",
  "vitals": "Temperature 38°C, pulse rate 130 bpm, systolic blood pressure 60 mmHg.",
  "physical_exam": "On examination, he is clammy, in a state of collapse and has a widespread urticarial rash. There is respiratory distress and stridor. There is an indurated circumscribed swelling on the inside of his left ankle. Chest auscultation reveals expiratory wheezes. \n\nOn Day 3, the urticarial rash was replaced by a diffuse erythematous rash, his face became slightly puffy, he had a bad headache, and a sustained fever of 38 to 39°C. The circumscribed swelling on the ankle was recognized as a 'trypanosomal chancre'.",
  "labs_and_diagnostics": "Initial blood film for malaria parasites reported negative. On admission: Haemoglobin 17.4 d/dL; white cell count 6.1 G/L (polymorphs 85%, lymphocytes 10%); erythrocyte sedimentation rate 5 mm/hour; blood film negative for malaria parasites; chest radiograph normal; stool and urine microscopy negative. \n\nLater, a thick blood film revealed 5 to 10 trypanosomes per high power field. Cerebrospinal fluid (CSF) examined by lumbar puncture 24 hours after the first dose of suramin was normal. Urine monitored weekly during suramin treatment showed protein, casts, and white cells towards the end of treatment, which disappeared a few weeks after treatment finished.",
  "differential_diagnosis": "Initial diagnosis was a possible hypersensitivity reaction to a tick bite. Other differentials included invasive helminthiasis (acute schistosomiasis/Katayama syndrome, acute fascioliasis, Loeffler’s syndrome), rickettsial disease, and connective tissue disease.",
  "management_and_clinical_course": "Initially treated with paracetamol prior to admission. On admission, anaphylactic shock was diagnosed, and he was given 0.5ml of 1:1000 adrenaline by deep intramuscular injection with good effect. He was admitted and over the next 2 days treated with intermittent injections of intramuscular adrenaline, intravenous hydrocortisone, and oral antihistamines for episodes of widespread urticaria with stridor and audible wheezing. \n\nOn day 3, his condition changed: stridor and wheezing ceased, urticarial rash was replaced by a diffuse erythematous rash, face became puffy, headache developed, and a sustained fever of 38-39°C appeared. Trypanosomiasis was confirmed. He was given a test dose of suramin 0.25 g with no ill effect, followed by 0.5 g 2 days later, 1.0 g another 2 days later, and then weekly doses of 1.0 g to a total of 5.75g suramin without ill effect. His urine was monitored weekly.",
  "final_diagnosis": "Human African Trypanosomiasis (HAT), likely East African trypanosomiasis (Trypanosoma brucei rhodesiense).",
  "disease_name_short": "Human African Trypanosomiasis (HAT)"
}