{
  "patient_information": "A 30-year-old woman, born in Santa Cruz (Bolivia), arrived in Europe 4 months prior. She lived in an urban environment for the past 20 years but grew up in a rural area during her childhood. She has no other relevant medical history, does not take any medication, and expresses the wish to become pregnant.",
  "chief_complaint": "Progressive dyspnoea at moderate exertion (New York Heart Association grade II) and self-limiting palpitations.",
  "history_of_present_illness": "She reports a 2-year history of progressive dyspnoea at moderate exertion (NYHA grade II) along with self-limiting palpitations. She has no other relevant medical history and does not take any medication. She expresses the wish to become pregnant.",
  "exposure_and_epidemiology": "Born in Santa Cruz (Bolivia), a highly endemic country for Chagas disease. Arrived in Europe 4 months prior. Grew up in a rural area during childhood, lived in an urban environment for the past 20 years.",
  "vitals": "Blood pressure: 110/65 mmHg. Pulse: regular at 40 bpm. SpO2: 99% on ambient air.",
  "physical_exam": "On auscultation, cardiac sounds are clear and there are no murmurs. The chest is clear. There is no peripheral oedema and the jugular venous pressure is not raised. No clinical signs of heart failure.",
  "labs_and_diagnostics": "Full blood count and basic blood chemistry tests were normal. ECG showed sinus bradycardia with right bundle branch block. Chest radiograph showed moderate cardiomegaly. Both serological tests for Chagas disease (detection of IgG antibodies against Trypanosoma cruzi using two different methods) came back positive. During adverse reaction to benznidazole, mild eosinophilia was noted. Complete cardiological evaluation revealed sinus dysfunction without symptomatic bradycardia or syncope. Echocardiography showed a hypertrophic left ventricle without obstruction.",
  "differential_diagnosis": "In a recent migrant from Bolivia, pathologies to be screened for include active and latent tuberculosis, HIV, hepatitis B, hepatitis C, strongyloidiasis, and Chagas disease.",
  "management_and_clinical_course": "The patient was classified as having chagasic cardiomyopathy. As she intended to become pregnant, antitrypanosomal therapy was offered. She started treatment with benznidazole 5 mg/kg per day for 60 days. Fifteen days into treatment, she developed a pruritic maculopapular rash and mild eosinophilia. Benznidazole was discontinued, and she received corticosteroids and antihistamines for 5 days, leading to complete resolution of the skin rash. Re-introduction of benznidazole was tolerated well, and she completed the entire 60-day course. Follow-up 5 years later showed stable cardiac function, and she gave birth to a healthy child.",
  "final_diagnosis": "Chagasic cardiomyopathy.",
  "disease_name_short": "Chagas disease"
}