{
  "patient_information": "23-year-old HIV-positive Zambian woman. Diagnosed with HIV 1 month prior, not yet on ART, taking co-trimoxazole prophylaxis for 7 days. Successfully treated for pulmonary tuberculosis 4 years ago. Unmarried with three children, works in a hospital cafeteria. Does not drink alcohol or use recreational drugs.",
  "chief_complaint": "New-onset seizure (first ever).",
  "history_of_present_illness": "The patient suffered her first ever seizure, which occurred out of sleep. Her son found her unresponsive, shaking all four limbs for 5 to 10 minutes. She was diagnosed with HIV infection 1 month prior and is not on antiretroviral therapy (ART) but has been taking co-trimoxazole prophylaxis for 7 days. She had been successfully treated for pulmonary tuberculosis 4 years ago.",
  "exposure_and_epidemiology": "From Zambia. Works in a hospital cafeteria. Lives in Lusaka, sub-Saharan Africa.",
  "vitals": "Normal vital signs, afebrile.",
  "physical_exam": "Looks well. GCS score 15/15. No meningism. Chest clear. Neurological examination unremarkable.",
  "labs_and_diagnostics": "Malaria rapid diagnostic test: negative. Blood results: WBC 5.8 x 10^9/L (normal), Haemoglobin 11.0 g/dL (low), Platelets 215 x 10^9/L (normal), CD4 count 153 cells/μL (low), Serum sodium 135 mmol/L (normal), Serum glucose 4.5 mmol/L (normal). Lumbar puncture: Opening pressure normal. CSF clear. CSF results: Leukocytes 5 cells/μL (normal), CSF protein 0.78 g/L (slightly raised), CSF glucose 2.9 mmol/L (normal). Cryptococcal antigen (CrAG) negative, India Ink stain negative, Gram stain negative, Ziehl–Neelsen stain negative. EEG: focal slowing in the right hemisphere. CT scan of brain: frontal and parietal hypodense lesions in the white matter of the right hemisphere, no contrast enhancement present.",
  "differential_diagnosis": "Tuberculoma, progressive multifocal leukoencephalopathy (PML), cerebral toxoplasmosis, cryptococcoma, brain abscess, primary CNS lymphoma, neurocysticercosis.",
  "management_and_clinical_course": "Management aims to prevent further seizures with antiepileptic treatment and manage the underlying condition. Counselling for the patient and guardians regarding the epileptic disorder is recommended. Antiepileptic drug choice should consider local availability and cost (phenobarbitone or carbamazepine are most available and affordable in sub-Saharan Africa; newer drugs like levetiracetam are not routinely available; phenytoin and valproic acid also used but supply unreliable). Potential hepatic enzyme induction effects of phenobarbitone/carbamazepine on ART and hormonal contraception must be considered. For PML, commencing antiretrovirals is the only therapeutic option.",
  "final_diagnosis": "Progressive Multifocal Leukoencephalopathy (PML) is strongly suggested by brain imaging showing hypodense, non-enhancing white matter lesions and the patient's advanced immunosuppression (low CD4 count) due to HIV.",
  "disease_name_short": "PML"
}